app/controllers/template/template_controller.rb

SELECT  "pages".* FROM "pages" WHERE "pages"."url" = ? LIMIT 1  [["url", "homepage"]]
---
  def homepage
    if(@page = Page.find_by(url: 'homepage'))

SELECT  "pages".* FROM "pages" WHERE "pages"."url" = ? LIMIT 1  [["url", "prodotti"]]
SELECT  "types".* FROM "types" WHERE "types"."url" = ? LIMIT 1  [["url", "prodotti"]]
---
  def routes
    # params url, no params id, url is a page
    if(params[:url] and !params[:id] and @page = Page.find_by(url: params[:url] ))
      @head_title = @page.title.capitalize
      render "template/pages/#{params[:url] }.html.erb"
    # params url, no params id, url is a type
  elsif(params[:url] and !params[:id] and @type = Type.find_by(url: params[:url]) and @type.visible)