app/controllers/admin/admin_controller.rb

  def home
    @notes = Note.last(4)
    @user = User.find(session[:user])
---
SELECT  "notes".* FROM "notes"  ORDER BY "notes"."id" DESC LIMIT 4
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def access
    if (!params[:user])
      redirect_to admin_path
    end
    @user = User.find_by_email(params[:user][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "admin@mail.com"]]

  def generate_migration
    # delete old gams_seeds files
    FileUtils.rm_rf(Dir.glob("#{Rails.root}/db/seeds/*"))
    # generate new gams_seeds file
    File.open("#{Rails.root}/db/gams-seeds/gams_seeds.rb", "a") do |page|
      # generate pages seeds
      page.write("# DEFAULT PAGES \n")
      @pages = Page.all
      @pages.each do |object_page|
        page.write('Page.create(title: "'+object_page.title+'", url: "'+object_page.url+'") \n')
      end
      # generate fields seeds
      page.write("# DEFAULT FIELDS \n")
      @fields = Field.all
      @fields.each do |object_field|
        page.write('Field.create(type_field: "'+object_field.type_field+'", name: "'+object_field.name+'", title: "'+object_field.title+'", repeating: "'+object_field.repeating+'", page_id: "'+object_field.page_id+'", position: "'+object_field.position+'") \n')
      end
      # generate types seeds
      page.write("# DEFAULT TYPES \n")
      @types = Type.all
      @types.each do |object_type|
        page.write('Type.create(name: "'+object_type.name+'", title_s: "'+object_type.title_s+'", title_p: "'+object_type.title_p+'", url: "'+object_type.url+'", visible: '+object.visible+') \n')
      end
      # generate typefields seeds
      page.write("# DEFAULT TYPEFIELDS \n")
      @typefields = Typefield.all
---
SELECT "pages".* FROM "pages"
SELECT "fields".* FROM "fields"
SELECT "types".* FROM "types"
SELECT "typefields".* FROM "typefields"