app/controllers/admin/config_controller.rb

SELECT "types".* FROM "types"
---
          ActiveRecord::Migration.add_column :fields, "value_#{language}", :text
        end
        # add languages to types
        Type.all.each do |type|

SELECT "typefields".* FROM "typefields" WHERE "typefields"."type_id" = ?  [["type_id", 1]]
---
            ActiveRecord::Migration.add_column type.name, "title_#{language}", :string
          end
          # translate fields
          typefields = Typefield.where(type_id: type.id)

INSERT INTO "pages" ("title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Home"], ["url", "homepage"], ["created_at", "2015-11-26 21:52:15.226892"], ["updated_at", "2015-11-26 21:52:15.226892"]]
---
  def page_create
    @page = Page.new(title: params[:title], url: params[:url].downcase)
    if (@page.save)

SELECT "pages".* FROM "pages"
---
  def field_new
    @pages = Page.all

SELECT "pages".* FROM "pages"
SELECT "types".* FROM "types"
---
  def repeater_new
    @pages = Page.all
    @types = Type.all

INSERT INTO "fields" ("type_field", "name", "title", "page_id", "repeating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def repeater_create
    @field = Field.new(type_field: params[:type], name: params[:name].downcase, title: params[:title], page_id: params[:page], repeating: params[:repeating], position: params[:position])
    if (@field.save)

INSERT INTO "types" ("name", "title_s", "title_p", "url", "visible", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "prova"], ["title_s", "prova"], ["title_p", "prova"], ["url", "prova"], ["visible", "t"], ["created_at", "2015-11-25 14:04:34.404699"], ["updated_at", "2015-11-25 14:04:34.404699"]]
---
  def type_create
    @type = Type.new(name: params[:title_s].downcase, title_s: params[:title_s].downcase, title_p: params[:title_p].downcase, url: params[:url].downcase, visible: params[:visible])
    if(@type.save)

SELECT "types".* FROM "types"
---
  def typefield_new
    @types = Type.all

INSERT INTO "typefields" ("type_field", "name", "title", "type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["type_field", "editor"], ["name", "descrizione"], ["title", "Descrizione"], ["type_id", 1], ["created_at", "2015-11-26 21:26:45.959338"], ["updated_at", "2015-11-26 21:26:45.959338"]]
SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT 1  [["id", 1]]
---
  def typefield_create
    @typefield = Typefield.new(type_field: params[:type], name: params[:name].downcase, title: params[:title], type_id: params[:type_id], position: params[:position])
    if (@typefield.save)
      # add column to type for the new field
      table_name = Type.find(@typefield.type_id).name