app/controllers/admin/notes_controller.rb

  def index
    @notes = Note.paginate(:page => params[:page], :per_page => 12).order('created_at DESC')
---
SELECT  "notes".* FROM "notes"  ORDER BY created_at DESC LIMIT 12 OFFSET 0