app/controllers/admin/pages_controller.rb

SELECT  "pages".* FROM "pages"  ORDER BY title ASC LIMIT 12 OFFSET 0
---
  def index
    @pages = Page.paginate(:page => params[:page], :per_page => 12).order('title ASC')

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", 1]]
SELECT "fields".* FROM "fields" WHERE "fields"."page_id" = ?  ORDER BY position ASC  [["page_id", 1]]
---
  def edit
    @page = Page.find(params[:id])
    @fields = Field.where(page_id: @page.id).order("position ASC")

SELECT  "fields".* FROM "fields" WHERE "fields"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "fields" SET "value_it" = ?, "updated_at" = ? WHERE "fields"."id" = ?  [["value_it", "1,"], ["updated_at", "2015-11-27 12:57:06.058726"], ["id", 1]]
---
  def update
    error_list = ""
    params[:field].each do |field_id,field_value|
      @field = Field.find(field_id)
      if (!@field.update(value: field_value))