app/controllers/admin/types_controller.rb

SELECT  "types".* FROM "types" WHERE "types"."name" = ? LIMIT 1  [["name", "prova"]]
---
  def index
    if(@type = Type.find_by(name: params[:typename]))

SELECT  "types".* FROM "types" WHERE "types"."name" = ? LIMIT 1  [["name", "prova"]]
SELECT  "typefields".* FROM "typefields" WHERE "typefields"."name" = ? AND "typefields"."type_id" = ? LIMIT 1  [["name", "descrizione"], ["type_id", 1]]
---
  def show
    if(params[:typename] and params[:objectid] and @type = Type.find_by(name: params[:typename]))
      @type_model = @type.name.capitalize.constantize
      @type_object = @type_model.find(params[:objectid])
      @typefields = Typefield.where(type_id: @type.id)

SELECT  "types".* FROM "types" WHERE "types"."name" = ? LIMIT 1  [["name", "prova"]]
SELECT "typefields".* FROM "typefields" WHERE "typefields"."type_id" = ?  ORDER BY position ASC  [["type_id", 1]]
---
  def edit
    if(@type = Type.find_by(name: params[:typename]))
      @type_model = @type.name.capitalize.constantize
      @type_object = @type_model.find(params[:objectid])
      @typefields = Typefield.where(type_id: @type.id).order('position ASC')

SELECT  "types".* FROM "types" WHERE "types"."name" = ? LIMIT 1  [["name", "libro"]]
---
  def update
    if(params[:type] and @type = Type.find_by(name: params[:type]))

SELECT  "types".* FROM "types" WHERE "types"."name" = ? LIMIT 1  [["name", "prova"]]
SELECT "typefields".* FROM "typefields" WHERE "typefields"."type_id" = ?  ORDER BY position ASC  [["type_id", 1]]
---
  def new
    if(@type = Type.find_by(name: params[:typename]))
      @type_model = @type.name.capitalize.constantize
      @type_object = @type_model.new
      @typefields = Typefield.where(type_id: @type.id).order('position ASC')

SELECT  "types".* FROM "types" WHERE "types"."name" = ? LIMIT 1  [["name", "prova"]]
---
  def create
    if(params[:type] and @type = Type.find_by(name: params[:type]))