app/controllers/admin/uploads_controller.rb

  def index
    @uploads = Upload.all.reverse
---
SELECT "uploads".* FROM "uploads"

  def create
    @upload = Upload.new(params[:upload].permit!)
    # Ajax update for uploads list
    if(@upload.save)
      @uploads = Upload.all.reverse
---
INSERT INTO "uploads" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-30 20:46:58.451978"], ["updated_at", "2015-11-30 20:46:58.451978"]]
SELECT "uploads".* FROM "uploads"