app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users"  ORDER BY name ASC LIMIT 12 OFFSET 0
---
  def index
    @users = User.paginate(:page => params[:page], :per_page => 12).order('name ASC')

INSERT INTO "users" ("name", "email", "password_digest", "permissions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user].permit(:name, :email, :password, :password_confirmation, :permissions))
    if (@user.save)