app/views/layouts/admin/_menu.html.erb

    <% # List of sites custom types %>
    <% types = Type.where(visible: true).order('title_p DESC') %>
---
SELECT "types".* FROM "types" WHERE "types"."visible" = 't'  ORDER BY title_p DESC